*&---------------------------------------------------------------------*
* Report ZPNMB011
* プログラム名称    : 得意先向け個体識別番号送信
*
* プログラム概要    : 得意先向け個体識別番号送信
* 概要設計書No  :  MM_Z053          アドオン審議No :  182
* 作成日 : 2024/4/18              作成者 : 若林 徹
* コーディング規約 :v1.00
* 開発バージョン  :SAP S/4HANA
* 使用条件     : SAP S/4 HANA サーバのみ使用可能
*----------------------------------------------------------------------*
*  Copyright(C) FUJITSU LIMITED
*  All Rights Reserved.
*----------------------------------------------------------------------*
* 変更番号：001
* 変更日：2024/10/01 変更者：胡谷 和範
* 変更内容：管理番号（内変399）
*----------------------------------------------------------------------*
* 変更番号：002
* 変更日：2024/10/07 変更者：胡谷 和範
* 変更内容：PGレビュー指摘対応
*----------------------------------------------------------------------*
* 変更番号：003
* 変更日：2024/10/21 変更者：胡谷 和範
* 変更内容：横展開No.6対応
*----------------------------------------------------------------------*
* 変更番号：004
* 変更日：2025/01/10 変更者：カードナ　マルカス
* 変更内容：権限チェック対応
*----------------------------------------------------------------------*
* 変更番号：005
* 変更日：2025/02/13 変更者：山崎　智大
* 変更内容：PG品質改善対応（プラグマ対応）
*----------------------------------------------------------------------*
* 変更番号：006
* 変更日：2025/02/17 変更者：山崎　智大
* 変更内容：PG品質改善対応
*----------------------------------------------------------------------*
*&---------------------------------------------------------------------*
REPORT ZPNMB023 NO STANDARD PAGE HEADING
                            LINE-SIZE  132
                            LINE-COUNT  65
                            MESSAGE-ID ZPNM001.

*----------------------------------------------------------------------*
* インクルード定義
*----------------------------------------------------------------------*
*TOP インクルード
INCLUDE ZPNMB023TOP.

*配信Include側処理
INCLUDE ZDCDF001  ##INCL_OK.

*FORM インクルード
INCLUDE ZPNMB023F01.

************************************************************************
INITIALIZATION  ##DUPL_EVENT.
************************************************************************
* 初期化処理
  PERFORM FM_INITIAL_PROC.

************************************************************************
*AT SELECTION-SCREEN.
************************************************************************
* 入力チェック
AT SELECTION-SCREEN ON P_KUNNR.
  PERFORM FM_INPUT_CHECK_KUNNR.

AT SELECTION-SCREEN ON P_WERKS.
  PERFORM FM_INPUT_CHECK_WERKS.
  PERFORM FM_CHECK_AUTH.

************************************************************************
START-OF-SELECTION.
************************************************************************
* 主処理
  PERFORM FM_MAIN_PROC.
*
